In [1]:
import pandas as pd

In [2]:
prodotti = ["mele", "limoni", "nocciole", "insalata", "pasta", "pane"]
quantità = [5, 2, 20, 2, 3, 1]
prezzi = [0.20, 0.70, 0.15, 1, 0.80, 2]

In [3]:
df = pd.DataFrame(prodotti, columns=["Prodotti"])

In [4]:
df

   Prodotti
0      mele
1    limoni
2  nocciole
3  insalata
4     pasta
5      pane

In [5]:
df["Quantità"] = quantità

In [7]:
df["Prezzi"] = prezzi

In [9]:
df["Totale"] = df["Quantità"] * df["Prezzi"]

In [11]:
df["Totale+sped."] = df["Totale"] + 0.20

In [13]:
df.drop("Totale+sped.", axis=1, inplace=True)

In [16]:
df.drop(1, inplace=True)

In [17]:
df

   Prodotti  Quantità  Prezzi  Totale
0      mele         5    0.20     1.0
2  nocciole        20    0.15     3.0
3  insalata         2    1.00     2.0
4     pasta         3    0.80     2.4
5      pane         1    2.00     2.0

In [18]:
df.loc[1] = ["miele", 1, 1.50, 1.50]

In [19]:
df

   Prodotti  Quantità  Prezzi  Totale
0      mele         5    0.20     1.0
2  nocciole        20    0.15     3.0
3  insalata         2    1.00     2.0
4     pasta         3    0.80     2.4
5      pane         1    2.00     2.0
1     miele         1    1.50     1.5

In [20]:
df2 = pd.DataFrame([[2, 4, 6, 8], [4, 9, 16, 25], [10, 100, 125, 150]])

In [22]:
df2+5

    0    1    2    3
0   7    9   11   13
1   9   14   21   30
2  15  105  130  155

In [23]:
df2*2

    0    1    2    3
0   4    8   12   16
1   8   18   32   50
2  20  200  250  300

In [24]:
df2

    0    1    2    3
0   2    4    6    8
1   4    9   16   25
2  10  100  125  150

In [25]:
df2/df2

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [26]:
import numpy as np

In [27]:
df2.apply(np.sqrt)

          0     1         2          3
0  1.414214   2.0   2.44949   2.828427
1  2.000000   3.0   4.00000   5.000000
2  3.162278  10.0  11.18034  12.247449

In [28]:
def f(x):
    return x*x

In [29]:
df2.apply(f)

     0      1      2      3
0    4     16     36     64
1   16     81    256    625
2  100  10000  15625  22500

In [30]:
df2.apply(lambda x: x*x*x)

      0        1        2        3
0     8       64      216      512
1    64      729     4096    15625
2  1000  1000000  1953125  3375000